# --------    Groupby    --------

pandas groupby() allows you to group "rows of data" together and call aggregate functions

In [1]:
# Create dataframe, from a dictionary
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

in this DataFrame we have the companies: Google, Microsoft and FaceBook, name of different people & their sales

In [2]:
# groupby(): now we group the rows based-on of a column name
# groupby "company":
df.groupby('Company')
# it'll  create a groupby object, stored in a memory:  <pandas.core.groupby.DataFrameGroupBy object at <sEftislsK015E8B8C36D8>

In [3]:
# we can apply an aggregate function as below
byComp = df.groupby('Company')
byComp.mean()   # looks at "Sales" and give us the "mean"

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

#### pandas automatically ignores "non-numeric" columns
    # it applies mean() to all the columns that have "numerical values"
    # notice "Person" isn't counted because these are strings

In [4]:
# applying other aggrigate functions
byComp.sum()    # sum

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [5]:
byComp.std()    # standared deviations

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065